In [7]:
import pandas as pd
import numpy as np
from pandas import Series
dataframe = {'estado':['sp','rj','mg'],'população':[1,2,3]}
pd.DataFrame(dataframe)

  estado  população
0     sp          1
1     rj          2
2     mg          3

In [8]:
# Criando series no panda
vetor = Series([5,9,11,15])
vetor

0     5
1     9
2    11
3    15
dtype: int64

In [9]:
# Criando a serie especificando o indice
vetor2 = Series([6,7,8,9], index = ['a','b','c','d'])
print(vetor2[vetor2 > 6])
'd' in vetor2

b    7
c    8
d    9
dtype: int64

True

In [10]:
# convertendo dicionario
dicio = {'alexandre':10, 'lombarde':9}
vetor3 = Series(dicio)
vetor3

alexandre    10
lombarde      9
dtype: int64

In [11]:
# buscando e correlacionando indices em duas listas
nomes = ['alexandre', 'costa']
vetor4 = Series(dicio, index=nomes)
vetor4

alexandre    10.0
costa         NaN
dtype: float64

In [12]:
# concatenadno
vetor5 = vetor3 + vetor4
vetor5

alexandre    20.0
costa         NaN
lombarde      NaN
dtype: float64

In [13]:
# importanto dataframes de outras estruturas
from pandas import DataFrame

In [14]:
# definindo o dataset
dtset = {'estado':['santa catarina','parana','goias','bahia','minas gerais'],
        'ano':[2002,2003,2004,2005,2006],
        'populacao':[1.5,1.7,3.6,2.4,2.9]}
dataframe = DataFrame(dtset)
dataframe

           estado   ano  populacao
0  santa catarina  2002        1.5
1          parana  2003        1.7
2           goias  2004        3.6
3           bahia  2005        2.4
4    minas gerais  2006        2.9

In [15]:
# ou se nao configurar automaticamente
dataframe2 = DataFrame(dtset, columns = ['ano','estado','populacao','debito'], index=['um','dois','tres','quatro','cinco'])
dataframe2

         ano          estado  populacao debito
um      2002  santa catarina        1.5    NaN
dois    2003          parana        1.7    NaN
tres    2004           goias        3.6    NaN
quatro  2005           bahia        2.4    NaN
cinco   2006    minas gerais        2.9    NaN

In [16]:
# filtro por colunas
display(dataframe2 ['estado'])
display(dataframe2.loc['quatro'])

um        santa catarina
dois              parana
tres               goias
quatro             bahia
cinco       minas gerais
Name: estado, dtype: object

ano           2005
estado       bahia
populacao      2.4
debito         NaN
Name: quatro, dtype: object

In [24]:
# Lendo arquivos
df = pd.read_csv('Arquivos/salarios.csv', sep = ',')
df

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88967.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
...,...,...,...,...
32177,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$86520.00
32178,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$83616.00
32179,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$86520.00
32180,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$110352.00
32181,NaN,NaN,NaN,NaN

In [25]:
# adicionando itens ao data frame
s = df.iloc[0:3]
s.append(df.loc[4])

C:\Users\Alexandre\AppData\Local\Temp\ipykernel_21320\2293419295.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s.append(df.loc[4])

                  Name     Position Title   Department Employee Annual Salary
0      AARON,  ELVIA J   WATER RATE TAKER  WATER MGMNT              $88967.00
1    AARON,  JEFFERY M     POLICE OFFICER       POLICE              $80778.00
2       AARON,  KARINA     POLICE OFFICER       POLICE              $80778.00
4  ABAD JR,  VICENTE M  CIVIL ENGINEER IV  WATER MGMNT             $104736.00

In [19]:
# series temporal range de datas por s=segundos m=mes e y=ano
rng = pd.date_range('1/1/2018', periods = 5, freq = 'y')
# criando dados randomicos de acordo com as datas
ts = pd.Series(np.random.randint(0,500,len(rng)), index = rng)
ts

2018-12-31    422
2019-12-31    270
2020-12-31    198
2021-12-31     64
2022-12-31    291
Freq: A-DEC, dtype: int32

In [20]:
# outputs do pandas
import os
df.to_excel('Arquivos/output.xlsx', sheet_name='dados')
df.to_csv('Arquivos/output.csv')

In [21]:
# abrindo o arquivo excel
new = pd.read_excel('Arquivos/output.xlsx')
new.head()

,Unnamed: 0,Name,Position Title,Department,Employee Annual Salary
0,0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88967.00
1,1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00

In [22]:
# excluir arquivos
os.remove("Arquivos/output.xlsx")

In [23]:
# criando dataset excel e salvando
dataset = {"estado":['sp','rj'],'capital':['sp','rj']}
dataset2 = pd.DataFrame(dataset)
pd.DataFrame.to_excel(dataset2, excel_writer='training/dataset.xlsx', sheet_name='dados')

OSError: Cannot save file into a non-existent directory: 'training'